#include <iostream>
using namespace std;

int main() {
    double r, a, x, y;

    cout << "Введіть радіус кола (r) та сторону квадрата (a): ";
    cin >> r >> a;

    cout << "Введіть координати точки (x, y): ";
    cin >> x >> y;

    // Проверяем условия попадания в заштрихованную область 25 варианта
    if (x >= 0 && y <= 0 && y >= -x && (x*x + y*y <= r*r)) {
        cout << "Точка потрапляє в область (Так)" << endl;
    } else {
        cout << "Точка не потрапляє в область (Ні)" << endl;
    }

    return 0;
}